# Задание-1:
# Написать программу, выполняющую операции (сложение и вычитание) с простыми дробями.
# Дроби вводятся и выводятся в формате:
# n x/y ,где n - целая часть, x - числитель, у - знаменатель.
# Дроби могут быть отрицательные и не иметь целой части, или иметь только целую часть.
# Примеры:

print("HOMEWORK 4 Hard")
while 1:
    print("Задача-1")
    print("Задача-2")
    print("Задача-3")
    do = input("Введите номер задачи (0 - Выход): ")

    # Задача-1
    if do == "1":
        print("Задача-1")

        print("********************")

    # Задача-2
    if do == "2":
        print("Задача-2")

        print("********************")

    # Задача-3
    if do == "3":
        print("Задача-3")

        print("********************")

    if do == "0":
        break
