_author__ = 'Igor A.Provorov'

# Задача-1:
# Напишите скрипт, создающий директории dir_1 - dir_9 в папке,
# из которой запущен данный скрипт.
# И второй скрипт, удаляющий эти папки.

# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.

# Задача-3:
# Напишите скрипт, создающий копию файла, из которого запущен данный скрипт.


print("HOMEWORK 5 Easy")
while 1:
    print("Задача-1")
    print("Задача-2")
    print("Задача-3")
    do = input("Введите номер задачи (0 - Выход): ")

    # Задание-1:
    if do == "1":
        print("Задача-1")

        print("********************")

    # Задание-2:
    if do == "2":
        print("Задача-2")

        print("********************")

    # Задание-3:
    if do == "3":
        print("Задача-2")

        print("********************")

    if do == "0":
        break
